# 4. Задана натуральная степень k. Сформировать случайным образом список коэффициентов
# (значения от 0 до 100) многочлена и записать в файл многочлен степени k.
# Пример:
# k=2 => 2*x² + 4*x + 5 = 0 или x² + 5 = 0 или 10*x² = 0
# ----------------------------------------------------------------------------------------------------
# Рандом (от 0 до 100) коэффициентов A B C. +
# k - это x - вводит пользователь.
# Запись ответа в фаил.
# ---------------------------------------------------------------------------------------------------

from pprint import pprint
from random import randint
 
def random_coefficients(): # Функция создает три рандомных числа .
    abc = ["A", "B", "C"]
    tmp = []
    while len(tmp) < 3:
        x = randint(0, 101)
        if x not in tmp:
           tmp.append(x)
    return (f'{abc} -> {tmp}'.format(abc, tmp))



number = int(input('Введите число X: '))
list_abc = (random_coefficients())
print('Список коеффициентов многочлена: ')
print(list_abc) # ['A', 'B', 'C'] -> [42, 62, 65]

# with open('/Users/User/Desktop/Python_Language/home_Work_04/file_hw04_hW04.txt', 'a') as f:
#     f.write(int())
# -------------------------------------


