# Урок 4. Данные, функции и модули в Python (продолжение)
# ----------------------------------------------------------------------------------------------------
# 1. Задайте строку из набора чисел. Напишите программу, которая покажет большее и меньшее число.
# В качестве символа-разделителя используйте пробел.
# --------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 1:----------------------------------------------------------------------------------------
# outstr = input('Введите строку чисел через пробел: ').split(' ') # Прошу ввести строку чисел, через пробел.
# numbers = [] # Создаю список, для хранения
# for i in range(len(outstr)): # Прохожу по длине строки
#     numbers.append(int(outstr[i])) # Добавляю числа и меняю им тип данных на int
# print('Исходный массив: ')
# print(outstr) # ['111', '20', '-3', '91']
# # print('минимальное число = {}; \nмаксимальное число = {}'.format(min(numbers), max(numbers)))
# print(f'минимальное число = {min(numbers)}, максимальное число = {max(numbers)}') # минимальное число = -3, максимальное число = 111
# ---------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 2 через МЕТОД.
# ---------------------------------------------------------------------------------------------------
# def list_add(outstr):
#     numbers = []
#     for i in range(len(outstr)):
#         numbers.append(int(outstr[i]))
#     return numbers
# outstr = input('Введите строку чисел через пробел: ').split(' ')
# numbers = list_add(outstr)
# print(numbers) # [20, -10, 222, 99]
# print(f'минимальное число = {min(numbers)}, \nмаксимальное число = {max(numbers)}') # минимальное число = -10,максимальное число = 222
# ----------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 3 через МЕТОД.
# ---------------------------------------------------------------------------------------------------
# def listAdd(outstr):
#     numbers = []
#     for item in outstr:
#         numbers.append(int(item))
#     return numbers
# outstr = input('Введите строку чисел через пробел: ').split(' ')
# numbers = listAdd(outstr)
# print(numbers) # [111, 20, -3, 4]
# print(f'минимальное число = {min(numbers)}, \nмаксимальное число = {max(numbers)}') # минимальное число = -3,максимальное число = 111
# ---------------------------------------------------------------------------------------------------
# 2. Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами:
# 1) с помощью математических формул нахождения корней квадратного уравнения
# *2) с помощью дополнительных библиотек Python
# ----------------------------------------------------------------------------------------------------
# from dis import disco

# def solution(a, b, c): # Функция нахождения дискриминанта.
#     desc = (b ** 2) - (4 * a * c) # Считаю дискриминант.
#     if desc > 0: # Если дискриминант больше 0, корня два.
#         desc = desc ** 0.5
#         answer1 = (-b - desc) / (2 * a)
#         answer2 = (-b + desc) / (2 * a)
#         return answer1, answer2
#     elif desc == 0: # Если дискриминант равен 0
#         desc = desc ** 0.5
#         answer = -b / (2 * a)
#         return answer
#     else:
#         print('Решения нет.')

# a = 1   # 1
# b = 10  # 6
# c = 3   # 9
# print(f'Ответ: {solution(a, b, c)}') # Ответ: (-9.69041575982343, -0.30958424017657027)
# ---------------------------------------------------------------------------------------------------
#  РЕШЕНИЕ 2 короче
# ---------------------------------------------------------------------------------------------------
# def root(a, b, c):
#     disc = b ** 2 - 4 * a * c # Считаю дискриминант.
#     if disc >= 0:
#         x1 = (-b + (disc ** 0.5)) / (2 * a)
#         x2 = (-b - (disc ** 0.5)) / (2 * a)
#         return x1, x2
#     return None

# a = 1
# b = 6
# c = 9
# print(root(a, b, c)) # (-3.0, -3.0)
# ----------------------------------------------------------------------------------------------------
# 3. Задайте два числа. Напишите программу, которая найдёт НОК (наименьшее общее кратное) 
# этих двух чисел. Ответ записать в файл.
# ---------------------------------------------------------------------------------------------------
# РЕШЕНИЕ через алгоритм Евклида, нахождения НОК
# ----------------------------------------------------------------------------------------------------
# from itertools import count

# a = 2
# b = 13
# count = a * b # 
# while (a != b): # Выход из цикла при равенстве чисел.
#     if a > b: 
#         a = a - b
#     else: 
#         b = b - a
# print(count/b) # 26.0 
# ---------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 2, нахождения НОК, через библиотеку с записью в фаил.
# ---------------------------------------------------------------------------------------------------
# import math
# num_1 = int(input('Введите первое число: '))
# num_2 = int(input('Введите второе число: '))
# print(math.lcm(num_1, num_2))

# with open('file.txt', 'a') as f:
#     f.write(str(math.lcm(num_1, num_2))) # Записывает в фаил ответ (file.txt)
# ---------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 3
# ---------------------------------------------------------------------------------------------------
# def findNOK(a, b):
#     minnum = max(a, b) # Можно написать min(a, b) - будет больше итераций.

#     while True:
#         if minnum % a == 0 and minnum % b == 0:
#             break
#         minnum += 1
#     print(minnum)

# findNOK(int(input('Введите первое число: ')), int(input('Введите второе число: '))) # 26
# ---------------------------------------------------------------------------------------------------

