# Урок 3. Данные, функции и модули в Python
# --------------------------------------------------------------------------------------------------
# 1. Реализуйте алгоритм задания случайных чисел без использования встроенного генератора псевдослучайных чисел.
# ---------------------------------------------------------------------------------------------------
# from time import time

# sec = str(time())
# userInput = int(input('Введите придел: '))
# count = 0
# if userInput // 10 > 0:
#     count += 1
# # print(len(sec))
# # print(sec)
# num = sec[-count:-1]
# print(num)
# Не доделал.
# --------------------------------------------------------------------------------------------------
# 2. Задайте список. Напишите программу, которая определит, присутствует ли в заданном списке строк некое число.
# ['65h34q', 'sdg634d', '147jnbv']
# Привет:
# "7" -> 147jnbv
# ---------------------------------------------------------------------------------------------------
# list = ['65h734q', 'sdg634d', '147jnbv']
# n = '7' # тип строка, т.к. ''
# for i in list:
#     if i.find(n) >= 0:
#         print(i)
#     else:
#         print('none')
# Вывод: 
# 65h734q
# none
# 147jnbv
# -------------------------------------------------------------------------------------------------
# 3. Напишите программу, которая определит позицию второго вхождения строки в списке либо сообщит, что её нет.
# *Пример:*
# - список: ["qwe", "asd", "zxc", "qwe", "ertqwe"], ищем: "qwe", ответ: 3
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"], ищем: "йцу", ответ: 5
# - список: ["йцу", "фыв", "ячс", "цук", "йцукен"], ищем: "йцу", ответ: -1
# - список: ["123", "234", 123, "567"], ищем: "123", ответ: -1
# - список: [], ищем: "123", ответ: -1
# ----------------------------------------------------------------------------------------------------
# from cgi import print_arguments
# from itertools import count

# myList = ["qwe", "asd", "zxc", "qwe", "ertqwe"]
# myList = ["йцу", "фыв", "ячс", "цук", "йцукен", "йцу"]
# myString = "5"
# count = 0
# for i in range(0, len(myList)):
#     if myList[i] == myString:
#         count += 1
#         if count == 2:
#             print(i)
#             break
# if count < 2 :
#     print('-1')

# Вывод 1:
#  3
# Вывод 2:
#  5
# Вывод 3:
#  -1
# -------------------------------------------------------------------------------------------------
# Решение 2:
# from itertools import count


# list =  ["qwe", "asd", "zxc", "qwe", "ertqwe"]
# y = input('Ведите строку, для поиска в списке: ')
# count = 0
# for i in range(len(list)):
#     if list[i] == y:
#         count += 1
#         if count == 2:
#             print(i)
# if count < 2 :
#     print('-1')

