# Урок 4. Данные, функции и модули в Python (продолжение)
# =========================================================================================================
# while (k:=int(input('--> '))) <= 0: 
# Такая конструкция для ввода числа годится.
# --------------------------------------------------------------------------------------------------------
# Работа с файлом:
# 'w' - пересоздает/создаетб запись
# 'r' - чтение
# 'a' - дозапись в конец файла
# 'r+' - чтеине + дозапись

# f = open ('/Users/User/Desktop/Python_Language/seminars/file_sem004.txt', 'w')
# f.write('Hello, world!')
# f.close()
# ЛУЧШЕ писать так, т.к. эта конструкция сразу закрывает фаил после работы с ним.
# path = '/Users/User/Desktop/Python_Language/seminars/file_sem004.txt'
# with open('/Users/User/Desktop/Python_Language/seminars/file_sem004.txt', 'r') as f_data:
#     print(f_data.read())
# --------------------------------------------------------------------------------------------------------
# КОРТЕЖИ () - занимают меньше памяти. Если мне нужен список констант, лучше использовать кортеж.
# Set() - МНОЖЕСТВО - это не упорядоченные уникальные элементы.
# my_dict = {} # Пустые {} - это всегде СЛОВАРЬ.
# my_dict = dict() # Пустой СЛОВАРЬ
# my_dict = tuple() # Пустой КОРТЕЖ
# a = tuple('qweqwkj')
# Передаю список.
# a = tuple(['124, 124']) # ('124, 124',)
# a = set(['124, 124']) # {'124, 124'}
# print(a) # ('q', 'w', 'e', 'q', 'w', 'k', 'j')
# ПРИМЕР:--------------------------------------------------------------------------------------------------
# my_dict = {
#     'key_1': 100,
#     'key_2': 
#        {
#            'key_3': 123
#        }
# }

# for key, val in my_dict.items():
#     print(key, '--', val)
# Чтоб достать элемент из словаря
# print(my_dict['key_123']) # KeyError: 'key_123' 
# Чтобы не было ошибки пишу через .get('key_123', '?')
# print(my_dict.get('key_123', '?'))

# ЗАДАЧИ:==================================================================================================
# 1. Считать строку из набора чисел из фаила. Напишите программу, которая покажет большее и меньшее число.
# В качестве символа-разделителя используйте пробел. Результат записать в конец исходного фаила (x1 x2).
# =========================================================================================================
# path = '/Users/User/Desktop/Python_Language/seminars/file_sem004.txt'

# with open(path, 'w') as data:
#     data.write(f'2 5 7 10 3\n')
# with open(path, 'r') as data:
#     lst = data.read()

# new_lst = lst.split(' ')

# lst_int = [int(i) for i in new_lst]
# max_num = max(lst_int)
# min_num = min(lst_int)

# with open(path, 'a') as data:
#     data.write(f'max = {max_num} \n')
#     data.write(f'min = {min_num} \n')
# =========================================================================================================
# 2. Найдите корни квадратного уравнения Ax² + Bx + C = 0 двумя способами (получить КОРТЕЖ):
# 1) с помощью математических формул нахождения корней квадратного уравнения
# 2) с помощью дополнительных библиотек Python
# ==========================================================================================================
# import random


# def squre_def(A, B, C) -> tuple:
#     print(f'коэффициент А={A}\n'
#           f'коэффициент B={B}\n'
#           f'коэффициент C={C}')
#     D = B ** 2 - 4 * A * C
#     print(f'Дискриминант= {D}')
#     if D > 0:
#         x1 = (-B + D ** 0.5) / (2 * A)
#         x2 = (-B - D ** 0.5) / (2 * A)
#         print(f'Корень x1= {x1}')
#         print(f'Корень x2= {x2}')
#         return x1, x2
#     elif D == 0:
#         x = -B / (2 * A)
#         print(f'Корень x={x}')
#         return x, # Чтобы создать КОРТЕЖ из одного элемента пишу x, 
#     return 'Корней нет'


# print(squre_def(A=random.randint(1, 15),
#                 B=random.randint(1, 15),
#                 C=random.randint(1, 15)))

# =========================================================================================================
# 3. Задайте два числа. Напишите программу, которая найдёт НОК (наименьшее общее кратное) 
# этих двух чисел. Ответ записать в файл.
# =========================================================================================================


