#  Урок 1. Семинар. Знакомство с языком Python.
# ==============================================================================================
# Задача 1. Напишу программу, которая принемает на вход два числа и проверяет,
# является ли одно число квадратом другого.
# Пример:
#  - 5, 25 -> да
#  - 4, 16 -> да
#  - 25, 5 -> да
#  - 8, 9 -> нет
# --------------------------------------------------------------------------------------------
# a = int(input('Введите первое число: '))
# b = int(input('Введите второе число: '))
# if a**2 == b:
#     print('Первое число является квадратом второго')
# elif b**2 == a:
#     print('Второе число является квадратом первого')
# else:
#     print('Квадратов чисел нет')
# -----------------------------------------------------------------------------------------------------
# while True:
#     try:
#         number1 = int(input("Введите первое число: "))
#         number2 = int(input("Введите второе число: "))
#         if number1 < number1:
#             number1, number2 = number2, number1
#         break
#     except:
#         print("Неправильный ввод, попробуйте снова")
        

# def check_square():
#     if number1 * number1 == number2 or number2 * number2 == number1:
#         print(f"Число '{number1}' является квадратом числа '{number2}'")
#     else:
#         print(f"Число '{number1}' не является квадратом числа '{number2}'")

# check_square()
# --------------------------------------------------------------------------------------------
# a = int(input('введите первое число: '))
# b = int(input('введите второе число: '))
# if a == b ** 2 or b == a ** 2:
#     print(f'{a}, {b} -> да')
# else:
#     print(f'{a}, {b} -> нет')
# ============================================================================================
# Задача 2. Напишу программу, которая на вход принимает 5 чисел и находит максимальное из них.
# Пример:
# -1, 4, 8, 7, 5 -> 8
# -78, 55, 36, 90, 2 -> 90
# ----------------------------------------------------------------------------------------------
# a = [5, 17, -2, 0, 2]
# max = a[0]

# for i in a:
#     if i > max:
#         max = i

# print(max)
# ---------------------------------------------------------------------------------------------
# num = int(input('Введите какой длинны будет массив: '))
# my_list = []
# for i in range(num): # Заполнил список элементами. 
#     numbers = int(input('--> ')) # Ввод элемента с клавиатуры.
#     my_list.append(numbers) # .append() - добавит значение в конец списка.
# print(f'Сформированный список \n{my_list}')
# # print(max(my_list)) # Встроеная функция max()
# num_max = my_list[0]
# for iten in my_list[1:]: # Чтобы непроверять my_list[0] самим с собой, использую СРЕЗЫ [1:] - со второго элем. до конца.
#     if iten > num_max:
#         num_max = iten
# print(f'Максимальное число = {num_max}')
# ===================================================================================================
# Срезы:
# a = [5, 17, -2, 0, 2]
# print(a)
# b = a[:] # [:] - скопирует список от крайнего левого до крайне правого элемента
# print(b)
# ===================================================================================================
# Задача 3. Напишу программу, которая будет на вход принимать число N и выводить числа от -N до N
# Примеры:
# - 5 -> -5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5
# --------------------------------------------------------------------------------------------
# num = int(input('Введите число = '))
# print(f'{num} -> ')
# for i in range(-num, num):
#     print(i, end= ', ')
# print(num) # Чтобы последний элемент был без (,)
# ===================================================================================================
# Задача 4. Напишу программу, которая будет принимать на вход дробь 
# и показывать первую цифру дробной части числа.
# Примеры:
# - 6,78 -> 7
# - 5 -> нет
# - 0,34 -> 3
# ----------------------------------------------------------------------------------------------------
# number = float(input('Введите дробное число: '))
# if int(number*10 % 10) > 0:
#     print(int(number * 10 % 10))
# else:
#     print(f'В данном числе {number} нет дробной части')
# ----------------------------------------------------------------------------------------------------
# number = input('Введите дробное число: ') # 345,123
# print(number.split(',')[1][0])
# Делю строку (number) по запятой (.split(',')), обращаюсь ко второй половине = 123, первому элементу = 1.
# ----------------------------------------------------------------------------------------------------
# n = float(input('Input number: '))
# print(int(n * 10) % 10)
# ===================================================================================================
# Задача 5. Напишу программу, которая принимает на вход число и проверяет, 
# кратно ли оно (5 и 10) или 15, но не 30.
# ----------------------------------------------------------------------------------------------------
# num = int(input('Введите число: '))
# if (num % 5 == 0) and (num % 10 == 0) or (num % 15 == 0) and (num % 30 != 0):
#     print(f'Да число {num} кратно 5, 10 или 15.')
# else:
#     print('Нет')







