#  Урок 2. Семинар. Знакомство с языком Python (продолжение)
# ----------------------------------------------------------------------------------------------------
# цикл while
# i = 1
# while i <= 10:
#     print(i, end=' ')
#     i += 1
#     # # break # принудительно завершит выполнение программы после отбражения первого элемента, else не будет работать.
#     # continue # будет делать переход на новый круг и программа не дойдет до кода print(123)
#     # print(123)
# else:
#     print('END!')
# ----------------------------------------------------------------------------------------------------
# 1. Напишите программу, которая принимает на вход число N и выдаёт последовательность из N членов.
# *Пример:*
# - Для N = 5: 1, -3, 9, -27, 81
# ----------------------------------------------------------------------------------------------------
# РЕШЕНИЕ:
# number = int(input('Введите число: '))
# numbers = [1]
# for i in range(number - 1):
#     num = numbers[i] * -3
#     numbers.append(num)
# print(numbers)
# ---------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 2:
# n = int(input())
# value = 1
# for _ in range(n):
#     print(value, end=', ')
#     value *= -3
# ---------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 3:
# n = 5
# count = 0
# while count < n:
#     print(f'{count + 1}: {(-3) ** count}')
#     count += 1
# ----------------------------------------------------------------------------------------------------
# 2. Для натурального n создать последовательности 3n + 1.
# *Пример:*
# - Для n = 6:
# 1: 4,
# 2: 7,
# 3: 10,
# 4: 13,
# 5: 16,
# 6: 19
# ----------------------------------------------------------------------------------------------------
# РЕШЕНИЕ:
# number = int(input('Введите число: '))
# for i in range(1, number + 1):
#     num = (3 * i + 1)
#     print(f'{i}: {num}')
# ----------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 2:
# def the_sequence_of_numbers(n):
#     i = 1
#     while i <= n:
#         result = 3 * i + 1
#         print(f'{i}: {result}')
#         i += 1
# the_sequence_of_numbers(int(input('Введите число: ')))
# 3. Напишите программу, в которой пользователь будет задавать две
# строки, а программа - определять количество вхождений одной строки в другой.
# *Пример:*
# 'Я люблю Питон!'
# 'лю'
# ----------------------------------------------------------------------------------------------------
# РЕШЕНИЕ:
# s = input('Введите первую строку: ')
# # print(f"сочетание 'лю' встречается {s.count('лю')} раз") # Или вариант ниже
# answer = s.count('лю')
# print(f"сочетание 'лю' встречается {answer} раз")
# ----------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 2:
# a = input("Введите строку: ")
# b = input("Введите искомую подстроку: ")
# count = 0
# for i in range (0, len(a) - len(b)):
#     if b == a[i:i +len(b)]:
#         count += 1
# print(f"{count} раз")
# ----------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 3:
# x = input('Введите первую строку: ')
# y = input('Введите искомую строку: ')
# result = x.count(y)
# print(result)

