# Задача 1. Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
# ================================================================================================

text = 'Мы неабв очень любим Питон иабв Джавабв'
text_find = 'абв'
index = 0

my_list = text.split()
print(my_list) # ['Мы', 'неабв', 'очень', 'любим', 'Питон', 'иабв', 'Джавабв']
new_my_list = [i for i in my_list if 'абв' not in i]
print(new_my_list) # ['Мы', 'очень', 'любим', 'Питон']