# 1. Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, 
# стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных индексы элементы 3 и 9, ответ: 12
# ----------------------------------------------------------------------------------------------------
# my_list = [2, 3, 5, 9, 3]
# print(my_list)
# sum_non_pos = 0

# for x in my_list:
#     if x % 2 != 0:
#         sum_non_pos += x
    

# print(sum_non_pos)


my_list = [2, 3, 5, 9, 3]
print(my_list)

filtered = [x for x in my_list if x %2 == 0]


s = sum(filtered)

print(s)