# 3. Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу
# между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 10.01] => 0.19
# -----------------------------------------------------------------------------------------------

outstr = [1.1, 1.2, 3.1, 10.01]

for i in range(len(outstr)):
    outstr[i] = outstr[i] - int(outstr[i])


print(round(max(outstr) - min(outstr), 2))

