# 00. Написать программу, которая на вход принимает число и выдаёт его 
# квадрат (число умноженное на само себя).
# Например:
# 4 -> 16
# -3 -> 9
# -7 -> 49
# ===================================================================================================

print('Эта программа принимает на вход целое число и выдаёт его квадрат.')
num = int(input('Введите целое число: '))
square = num * num
print(f'Квадрат числа {num} = {square}')

