# 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.
# Пример:
# - пусть N = 4, тогда [ 1, 2, 6, 24 ] (1, 1*2, 1*2*3, 1*2*3*4)
# ===========================================================================================================

number = int(input('Введите целое число: '))
factorial = lambda x: ((x == 1) and 1) or x * factorial(x -1)
list = list( factorial(i) for i in range(1, number + 1))
print(f'Произведение чисел от 1 до {number} -> {list}')
