# 3. Задайте список из k чисел последовательности (1 + 1\k)^k и выведите на экран их сумму.
# -----------------------------------------------------------------------------------------------

# number = int(input('Введите число: '))
# sum = 0
# for i in range(1, number + 1):
#     num = (1 + 1 // i) ** i
#     print(f'{i}: {num}')
#     sum += num
# print(f'Сумма = {sum}')

# ----------------------------------------------------------------------------------------------------
# РЕШЕНИЕ 2 от одногрупника (это лучше на мой взгляд)

# k = int(input('Введите количество чисел в последовательности: '))
# numbers = []
# for i in range(0, k + 1):
#     input_value = int(input(f'Введите число № {i}: '))
#     numbers.append(input_value)
# sum = 0
# for i in numbers:
#     sum = (1 + 1 / k) ** k
# print('Сумма всех чисел последовательности:', round(sum, 4))






