# 3. Задайте список из k чисел последовательности (1 + 1\k)^k и выведите на экран их сумму.
# -----------------------------------------------------------------------------------------------

number = int(input('Введите число: '))
sum = 0
for i in range(1, number + 1):
    num = (1 + 1 // i) ** i
    print(f'{i}: {num}')
    sum += num
print(f'Сумма = {sum}')







