# `Задача 1. Напишите программу, удаляющую из текста все слова, содержащие ""абв"".
# ---------------------------------------------------------------------------------------------------
test = 'Мы неабв очень любим Питон иабв Джавабв'
text_find = 'абв'
index = 0

my_list = test.split()
print(my_list) # ['Мы', 'неабв', 'очень', 'любим', 'Питон', 'иабв', 'Джавабв']
i = 0
while i in range(len(my_list)):
    if text_find in my_list[i]:
        my_list.remove(my_list[i])
    else:
        i+= 1
print(my_list) # ['Мы', 'очень', 'любим', 'Питон']
